A = [ int(input(f"Напишите {i+1} значение: ")) for i in range(3) ]
print(f"Наши значения: {A}")

# №1  
print(A[0] and A[1] and A[2] and "Нет нулевых значений!!!")

# №2
print(A[0] or A[1] or A[2] or "Введены все нули!")

# №3
if A[0] >  A[1] + A[2]:
  print(f"({A[0]}) - ({A[1]}) - ({A[2]}) = \
        {A[0] - A[1] - A[2]}")
 
# №4
if A[0] <  A[1] + A[2]:
  print(f"({A[1]}) + ({A[2]}) - ({A[0]}) = \
        {-A[0] + A[1] + A[2]}")  

# №5
if A[0] > 50 and ((A[1] > A[0]) or (A[2] > A[0])):
  print('Вася')

# №6
if A[0] > 5 or ((A[1] == 7) and (A[2] == 7)):
  print('Петя')